app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hello Everyone!"], ["created_at", Fri, 06 Dec 2013 10:07:34 UTC +00:00], ["updated_at", Fri, 06 Dec 2013 10:07:34 UTC +00:00], ["user_id", 2]]