app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 31  [["password_digest", "$2a$04$1RrelFKqkQafSSBjQf3t3.nYVnpHKK7FmF550zKiiHoykxI17Y02O"], ["remember_token", "V1lFqD3GH0uib3DJwysb6g"], ["updated_at", Wed, 04 Dec 2013 15:12:29 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)